//我的第一个文字游戏模板
//目前是debug版本 日期：2020-11-09
//角色名称
var nameArray = ["蛋贩子","宝宝蛋","李桂英","李正琴","恩恩","臭气缝","薛阳"];
//引入背景图
var bgArray = ["image/b6.jpg","image/b5.jpg","image/b4.jpg","image/b4.jpg","image/b5.jpg","image/b1.jpg","image/b7.jpg"];                                                                                                              
//引入图
var imageArray = ["image/b2.jpg","image/b3.jpg"];
//引入声音
var soundArray = ["audio/bgm0.ogg"];
//主要文本 ;分隔 #(id,x,y,alpha)显示图片 $(id,loop)播放声音 %(id)停止声音(负数停止所有) @(index)显示角色名称 +换行 &(id)设置背景
var maintext = "万女士说自己前几天凌晨在抖音上偶然刷到一个直播间被正在介绍的一款金手镯所吸引,“足金实心，支持验货！”,见主播说得振振有词,万女士当即决定下单支付;&(2)本应是通过屏幕下方的“小黄车”,可万女士在付款时却找不到窗口,在主播的“示意”,万女士通过私信联系上店铺,客服立刻私发一条支付链接;#(0,40,34,1)#(1,350,90,1)尽管系统已提醒,“该链接非抖音小店链接”,但万女士并没有注意到,点进链接后她支付了1888元;殊不知这是骗子伪造的虚假平台,而在自己的抖音订单中,根本没有该记录;$(0,1)万女士试图与客服联系，却早已被拉黑;万女士立刻报警，几经周转追回骗款".split(";");
//结束文本
maintext.push("骗子之所以在深夜开直播,是看准了平台人工审核已经下班,系统自动审核识别没那么灵敏，在直播中，骗子会假意售“物美价廉”商品，吸引观众购买，而在付款时，通过虚假链接骗取钱款，直播间里大部分是骗子的“马甲”，当有观众公屏上提醒他人，则会被马上踢出直播间 ");